[
  {
    "generated_by_ai": true,
    "likes_count": "0",
    "requested_by": "user_2irDhhIowEtiBFeVsarU4MErvrc",
    "xata_version": 0,
    "xata_createdat": "2024-07-16T10:50:36.781Z",
    "xata_updatedat": "2024-07-16T10:50:36.781Z",
    "xata_id": "rec_cqb50v5qrj676goflbag",
    "snippet_title": "Dune universe",
    "snippet_type_and_data_mapping": [
      {
        "snippet_id": "rec_cqb50v5qrj676goflbag",
        "type": "rec_cqafk3325jvdoj83gfcg",
        "data": {
          "how": "The series uses a mix of action, adventure, and philosophical themes to explore the complexities of human nature and the consequences of power and control. The books are known for their detailed world-building, intricate plotlines, and complex characters.",
          "why": "The series explores themes of power, control, and the struggle for survival in a harsh environment. The books also delve into philosophical and ecological concepts, making it a thought-provoking and engaging read. The story is driven by the characters' motivations and desires, which are often shaped by their environments and circumstances.",
          "when": "The original Dune series was written by Frank Herbert between 1965 and 1985. The books have since been adapted into various forms of media, including films, television shows, and graphic novels.",
          "where": "The story takes place in a distant future, primarily on the desert planet of Arrakis, also known as Dune. The planet is the only source of a rare and powerful substance called melange, also known as spice, which is highly valued throughout the galaxy.",
          "what/who": "The Dune series by Frank Herbert is a collection of science fiction novels that follows the story of Paul Atreides and his family as they navigate the complexities of politics, ecology, and technology in a distant future. The main characters include Paul Atreides, Duke Leto Atreides, Lady Jessica, and Gurney Halleck.",
          "amazing facts": [
            "Frank Herbert was inspired to write Dune after visiting a desert region in Oregon and learning about the ecology of sandworms.",
            "The original Dune novel was rejected by several publishers before it was finally accepted by Chilton Books.",
            "The Dune series has been translated into over 20 languages and has sold over 20 million copies worldwide."
          ]
        },
        "xata_updatedat": "2024-07-16T10:50:36.935Z",
        "xata_id": "rec_cqb50vdqrj676goflbb0",
        "xata_version": 0,
        "xata_createdat": "2024-07-16T10:50:36.935Z"
      }
    ]
  }
]
